
{
    "fashion": [
        {
            "title": " עיצוב אופנה - מתוך הפרסום באתר המחלקה בשנקר",
            "content": 
            "מעצב אופנה - כמו בכל תחום אחר בעולם העיצוב ואולי אף יותר - חייב להיות בן-זמנו, להיות רגיש לכל השינויים וההתפתחויות סביבו ועם זה להכיר את המורשת התרבותית המקומית והבינלאומית.  המחלקה מאמינה בהליכה על גבולות דקים, באיזונים כמעט בלתי אפשריים: חינוך של אנשי מקצוע מיומנים בהיבטים העיצוביים והטכניים מבלי לאבד את הספונטני והראשוני; רגישות ומודעות לחידושים מבלי להניח לייחודי ולמקורי ללכת לאיבוד בתוך מבול החידושים; הכרת המורשת התרבותית העולמית מבלי לזנוח את המורשת התרבותית המקומית. הייצוג הגבוה של בוגרי שנקר בתעשייה המקומית והעולמית, כמעצבים, בעלי חברות, חוזי מגמות, אוצרים, קניינים ואנשי אקדמיה מוכיח שהניסיון ללכת על חבל דק, משתלם. תוכנית הלימודים במחלקה לעיצוב אופנה בשנקר מכוונת ליוצר ומעצב שמחד איש מקצוע מיומן בהיבטים העיצוביים והטכניים של התחום ומאידך בעל היכרות עמוקה של רוח תקופתו של עולם העיצוב, האמנות והתרבות. בכך היא מעודדת לביטוי אישי, מקורי ויצירתי בכל התחומים של עולם האופנה והאביזרים. "
        } 
    ],
    "visual": [
        {
            "title": "עיצוב גרפי ותקשורת חזותית",
            "content": 
            "עיצוב גרפי ותקשורת חזותית הם שיקוף חזותי, חושי וטקסטואלי הממחיש רעיון, כוונה, רגש, רצון, מוצר ומידע. עיצוב גרפי כולל את עיצוב האות, עיצוב הדף, עיצוב הספר, עיצוב כרזה, עיצוב אתרים, איור, עיצוב לוגו, קומיקס, יצירת תדמית, וכל ויז'ואל, דימוי או פרסומת שאליהם אנו נחשפים. עיצוב גרפי הוא תוכן המגשר בין המסר והמוצר לבין הצופה. זו הדרך שבה מסר עיצובי מעניק משמעות לתוכן ולהבנת הקונספט. על המעצב להיות ער לאחריותו כלפי הצופה ולקיומם של קשרי גומלין ערכיים, היסטוריים, תרבותיים ואינפורמטיביים בין עבודתו לבין תרבות העיצוב. עיצוב גרפי ותקשורת חזותית הם הערכים היוצרים את תרבות העיצוב ועיצוב התרבות."
        }
    ],
    "jewelry": [
        {
            "title": "עיצוב תכשיטים",
            "content": 
            "הינו תחום של אמנות שימושית הדורש מיומנות טכנית בתחום הצורפות  - עיבוד מתכות יקרות כגון כסף וזהב, ושיבוץ אבנים יקרות. תכשיטים נוצרים כפריטים בודדים (one of a kind) או בייצור תעשייתי של סדרות. על עיצוב תכשיטים לענות על קריטריונים  כגון ענידות, נוחות, גמישות מראה אסתטי ומחיר סביר. תפקידו המסורתי של התכשיט היה לסמן מצב אישי, סטטוס חברתי, וכמו כן להגן על העונד אותו ולהעניק לו סגולות לבריאות ולהצלחה. ניתן להבחין בין תכשיטים אתניים, תכשיטי אופנה, תכשיטי יוקרה, ותכשיטים אמנותיים. התכשיט האמנותי העכשווי אימץ לעצמו גישות מעולם האמנות:  שבירת מוסכמות, חציית גבולות, מחאה, התרסה והיקסמות מחומרים חדשים ומטכנולוגיות מתקדמות. יוצרי התכשיטים מבטאים באמצעות התכשיט אמירה אישית, חברתית או פוליטית."
        }
    ],
    "industrial": [
        {
            "title": "עיצוב תעשייתי",
            "content": 
              "מגשר בין צרכים ארגונומיים וצרכים הנדסיים לבין צורכי עיצוב כדי להפוך מוצר ליעיל, לאיכותי ולמעוצב כהלכה. עיצוב תעשייתי הוא הגשר המעשי שבין הרצוי והמצוי, עיצוב הנותן מענה לצרכים אישיים, לצרכים חברתיים ולצרכים מסחריים."         
        }
    ]
}